2024-11-19 15:33:23,344 INFO: Aplicación iniciada
2024-11-19 15:37:33,622 INFO: Aplicación iniciada
2024-11-19 15:38:16,126 INFO: Aplicación iniciada
2024-11-19 15:38:16,362 INFO: Aplicación iniciada
2024-11-19 15:38:31,193 INFO: Aplicación iniciada
2024-11-19 15:38:31,339 INFO: Aplicación iniciada
2024-11-19 15:38:39,597 INFO: Aplicación iniciada
2024-11-19 15:38:39,745 INFO: Aplicación iniciada
2024-11-19 15:42:27,992 INFO: Aplicación iniciada
2024-11-19 15:42:41,100 INFO: Aplicación iniciada
2024-11-19 15:42:41,297 INFO: Aplicación iniciada
2024-11-19 15:44:11,815 INFO: Aplicación iniciada
2024-11-19 15:44:38,090 INFO: Aplicación iniciada
2024-11-19 15:45:02,772 INFO: Aplicación iniciada
2024-11-19 15:45:05,753 INFO: Aplicación iniciada
2024-11-19 15:45:23,124 INFO: Aplicación iniciada
2024-11-19 15:47:28,720 INFO: Aplicación iniciada
2024-11-19 15:54:22,803 INFO: Aplicación iniciada
2024-11-19 15:54:22,963 INFO: Aplicación iniciada
2024-11-19 15:55:46,023 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/0', 'switchport mode trunk', 'switchport trunk allowed vlan add 65', 'exit']
2024-11-19 15:55:47,198 INFO: VLAN 65 asignada al puerto Et0/0 en switch 192.168.100.121
2024-11-19 15:58:50,086 INFO: Aplicación iniciada
2024-11-19 15:59:14,053 INFO: Aplicación iniciada
2024-11-19 15:59:14,195 INFO: Aplicación iniciada
2024-11-19 15:59:34,519 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/0', 'switchport mode access', 'switchport access vlan 65', 'no shutdown', 'exit']
2024-11-19 15:59:35,415 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/0
SW18(config-if)#
SW18(config-if)#switchport mode access
SW18(config-if)#
SW18(config-if)#switchport access vlan 65
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 15:59:35,415 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 15:59:39,882 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1249 bytes to 898 bytes[OK]
SW18#
SW18#
*Nov 19 19:59:36.386: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 15:59:40,026 INFO: VLAN 65 asignada al puerto Et0/0 en switch 192.168.100.121
2024-11-19 15:59:59,604 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/3', 'switchport mode trunk', 'switchport trunk allowed vlan add 65', 'no shutdown', 'exit']
2024-11-19 16:00:00,627 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/3
SW18(config-if)#
SW18(config-if)#switchport mode trunk
Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 65
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:00:00,627 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:00:05,094 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1249 bytes to 898 bytes[OK]
SW18#
SW18#
*Nov 19 20:00:01.588: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 16:00:05,237 INFO: VLAN 65 asignada al puerto Et0/3 en switch 192.168.100.121
2024-11-19 16:00:34,793 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/0', 'switchport mode trunk', 'switchport trunk allowed vlan add 1', 'no shutdown', 'exit']
2024-11-19 16:00:35,785 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/0
SW18(config-if)#
SW18(config-if)#switchport mode trunk
Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 1
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:00:35,785 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:00:40,251 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1249 bytes to 898 bytes[OK]
SW18#
SW18#
*Nov 19 20:00:36.756: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 16:00:40,395 INFO: VLAN 1 asignada al puerto Et0/0 en switch 192.168.100.121
2024-11-19 16:03:59,634 INFO: VLAN 121 - clases agregada en switch 192.168.100.121
2024-11-19 16:04:15,166 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/0', 'switchport mode trunk', 'switchport trunk allowed vlan add 121', 'no shutdown', 'exit']
2024-11-19 16:04:16,379 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/0
SW18(config-if)#
SW18(config-if)#switchport mode trunk
Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 121
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:04:16,379 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:04:20,836 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1293 bytes to 934 bytes[OK]
SW18#
SW18#
*Nov 19 20:04:17.342: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 16:04:21,193 INFO: VLAN 121 asignada al puerto Et0/0 en switch 192.168.100.121
2024-11-19 16:04:47,256 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/0', 'switchport mode access', 'switchport access vlan 121', 'no shutdown', 'exit']
2024-11-19 16:04:48,317 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/0
SW18(config-if)#
SW18(config-if)#switchport mode access
SW18(config-if)#
SW18(config-if)#switchport access vlan 121
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:04:48,317 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:04:52,795 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1294 bytes to 936 bytes[OK]
SW18#
SW18#
*Nov 19 20:04:49.280: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 16:04:52,938 INFO: VLAN 121 asignada al puerto Et0/0 en switch 192.168.100.121
2024-11-19 16:05:24,455 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/2', 'switchport mode access', 'switchport access vlan 121', 'no shutdown', 'exit']
2024-11-19 16:05:25,495 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/2
SW18(config-if)#
SW18(config-if)#switchport mode access
SW18(config-if)#
SW18(config-if)#switchport access vlan 121
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:05:25,495 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:05:29,963 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1346 bytes to 959 bytes[OK]
SW18#
SW18#
*Nov 19 20:05:26.469: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 16:05:30,105 INFO: VLAN 121 asignada al puerto Et0/2 en switch 192.168.100.121
2024-11-19 16:12:53,126 INFO: Aplicación iniciada
2024-11-19 16:13:32,800 INFO: VLAN 65 - Santiago agregada en switch 192.168.100.121
2024-11-19 16:13:53,949 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/0', 'switchport trunk encapsulation dot1q', 'switchport mode trunk', 'switchport trunk allowed vlan add 65', 'no shutdown', 'exit']
2024-11-19 16:13:55,063 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/0
SW18(config-if)#
SW18(config-if)#switchport trunk encapsulation dot1q
SW18(config-if)#
SW18(config-if)#switchport mode trunk
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 65
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:13:55,063 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:13:59,520 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1453 bytes to 999 bytes[OK]
SW18#
SW18#
*Nov 19 20:13:56.040: %SYS-5-CONFIG_I: Configured from console by console
*Nov 19 20:13:56.688: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to down
2024-11-19 16:13:59,663 INFO: VLAN 65 asignada al puerto Et0/0 en switch 192.168.100.121
2024-11-19 16:14:36,676 INFO: Aplicación iniciada
2024-11-19 16:15:23,437 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/2', 'switchport mode access', 'switchport access vlan 65', 'no shutdown', 'exit']
2024-11-19 16:15:24,430 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/2
SW18(config-if)#
SW18(config-if)#switchport mode access
SW18(config-if)#
SW18(config-if)#switchport access vlan 65
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:15:24,430 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:15:28,888 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1452 bytes to 999 bytes[OK]
SW18#
SW18#
*Nov 19 20:15:25.407: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 16:15:29,031 INFO: VLAN 65 asignada al puerto Et0/2 en switch 192.168.100.121
2024-11-19 16:26:23,721 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/3', 'switchport trunk encapsulation dot1q', 'switchport mode trunk', 'switchport trunk allowed vlan add 121', 'no shutdown', 'exit']
2024-11-19 16:26:24,854 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/3
SW18(config-if)#
SW18(config-if)#switchport trunk encapsulation dot1q
SW18(config-if)#
SW18(config-if)#switchport mode trunk
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 121
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:26:24,854 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:26:29,361 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1475 bytes to 1008 bytes[OK]
SW18#
SW18#
*Nov 19 20:26:25.835: %SYS-5-CONFIG_I: Configured from console by console
*Nov 19 20:26:26.480: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/3, changed state to down
2024-11-19 16:26:29,504 INFO: VLAN 121 asignada al puerto Et0/3 en switch 192.168.100.121
2024-11-19 16:37:45,500 INFO: Aplicación iniciada
2024-11-19 16:38:07,026 INFO: Aplicación iniciada
2024-11-19 16:38:07,190 INFO: Aplicación iniciada
2024-11-19 16:39:10,327 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/0', 'switchport trunk encapsulation dot1q', 'switchport mode trunk', 'switchport trunk allowed vlan add 65', 'no shutdown', 'exit']
2024-11-19 16:39:11,383 DEBUG: Salida de comandos: 

SW18#
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/0
SW18(config-if)#
SW18(config-if)#switchport trunk encapsulation dot1q
SW18(config-if)#
SW18(config-if)#switchport mode trunk
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 65
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:39:11,384 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:39:15,890 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1475 bytes to 1007 bytes[OK]
SW18#
SW18#
*Nov 19 20:39:12.369: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 16:39:16,044 INFO: VLAN 65 asignada al puerto Et0/0 en switch 192.168.100.121
2024-11-19 16:44:03,762 INFO: Aplicación iniciada
2024-11-19 16:44:03,949 INFO: Aplicación iniciada
2024-11-19 16:44:36,214 INFO: VLAN 179 - oficina agregada en switch 192.168.100.121
2024-11-19 16:45:00,861 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/1', 'switchport trunk encapsulation dot1q', 'switchport mode trunk', 'switchport trunk allowed vlan add 179', 'no shutdown', 'exit']
2024-11-19 16:45:02,494 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/1
SW18(config-if)#
SW18(config-if)#switchport trunk encapsulation dot1q
SW18(config-if)#
SW18(config-if)#switchport mode trunk
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 179
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:45:02,494 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:45:07,101 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1470 bytes to 1002 bytes[OK]
SW18#
SW18#
*Nov 19 20:45:03.483: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 16:45:07,244 INFO: VLAN 179 asignada al puerto Et0/1 en switch 192.168.100.121
2024-11-19 16:47:37,878 INFO: Aplicación iniciada
2024-11-19 16:47:58,604 INFO: Enviando comandos al switch 192.168.100.121: ['interface Et0/2', 'switchport trunk encapsulation dot1q', 'switchport mode trunk', 'switchport trunk allowed vlan add 65', 'no shutdown', 'exit']
2024-11-19 16:47:59,738 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Et0/2
SW18(config-if)#
SW18(config-if)#switchport trunk encapsulation dot1q
SW18(config-if)#
SW18(config-if)#switchport mode trunk
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 65
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:47:59,738 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:48:04,245 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1470 bytes to 1002 bytes[OK]
SW18#
SW18#
*Nov 19 20:48:00.717: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 16:48:04,388 INFO: VLAN 65 asignada al puerto Et0/2 en switch 192.168.100.121
2024-11-19 16:48:57,868 INFO: Enviando comandos al switch 192.168.100.121: ['interface e0/1', 'switchport trunk encapsulation dot1q', 'switchport mode trunk', 'switchport trunk allowed vlan add 65', 'no shutdown', 'exit']
2024-11-19 16:48:58,898 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface e0/1
SW18(config-if)#
SW18(config-if)#switchport trunk encapsulation dot1q
SW18(config-if)#
SW18(config-if)#switchport mode trunk
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 65
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 16:48:58,899 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 16:49:03,405 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1470 bytes to 1002 bytes[OK]
SW18#
SW18#
*Nov 19 20:48:59.878: %SYS-5-CONFIG_I: Configured from console by console
2024-11-19 16:49:03,548 INFO: VLAN 65 asignada al puerto e0/1 en switch 192.168.100.121
2024-11-19 20:40:22,049 INFO: Aplicación iniciada
2024-11-19 20:40:22,246 INFO: Aplicación iniciada
2024-11-19 20:42:22,883 ERROR: Error al obtener VLANs de 192.168.100.121: 

Pattern not detected: 'terminal\\ length\\ 0' in output.

Things you might try to fix this:
1. Adjust the regex pattern to better identify the terminating string. Note, in
many situations the pattern is automatically based on the network device's prompt.
2. Increase the read_timeout to a larger value.

You can also look at the Netmiko session_log or debug log for more information.


2024-11-19 20:46:33,932 INFO: Aplicación iniciada
2024-11-19 20:47:10,596 INFO: Aplicación iniciada
2024-11-19 20:47:10,757 INFO: Aplicación iniciada
2024-11-19 20:47:56,286 INFO: Enviando comandos al switch 192.168.100.121: ['interface Ethernet0/0', 'switchport trunk encapsulation dot1q', 'switchport mode trunk', 'switchport trunk allowed vlan add 65', 'no shutdown', 'exit']
2024-11-19 20:47:57,716 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#

SW18(config)#
SW18(config)#interface Ethernet0/0
SW18(config-if)#
SW18(config-if)#switchport trunk encapsulation dot1q
SW18(config-if)#
SW18(config-if)#switchport mode trunk
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 65
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config)#

SW18(config)#
SW18(config)#end
SW18#
2024-11-19 20:47:57,716 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 20:48:01,717 INFO: Enviando comandos al switch 192.168.100.121: ['interface Ethernet0/0', 'switchport trunk encapsulation dot1q', 'switchport mode trunk', 'switchport trunk allowed vlan add 65', 'no shutdown', 'exit']
2024-11-19 20:48:05,761 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Ethernet0/0
SW18(config-if)#
SW18(config-if)#switchport trunk encapsulation dot1q
SW18(config-if)#
SW18(config-if)#switchport mode trunk
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 65
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-19 20:48:05,762 INFO: Guardando configuración en switch 192.168.100.121
2024-11-19 20:48:08,430 DEBUG: Salida de guardar configuración: 
SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1470 bytes to 1002 bytes[OK]
SW18#
SW18#
*Nov 20 00:47:58.589: %SYS-5-CONFIG_I: Configured from console by console
SW18#
SW18#
SW18#
SW18#
SW18#terminal width 511
SW18#
SW18#terminal length 0
SW18#
SW18#
SW18#
SW18#
SW18#
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#
SW18(config)#interface Ethernet0/0
SW18(config-if)#
SW18(config-if)#switchport trunk encapsulation dot1q
SW18(config-if)#
SW18(config-if)#switchport mode trunk
SW18(config-if)#
SW18(config-if)#switchport trunk allowed vlan add 65
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config)#
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
SW18#
*Nov 20 00:48:04.766: %SYS-5-CONFIG_I: Configured from console by console
SW18#
SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1470 bytes to 1000 bytes[OK]
SW18#
2024-11-19 20:48:08,522 INFO: VLAN 65 asignada al puerto Ethernet0/0 en switch 192.168.100.121
2024-11-19 20:48:12,170 DEBUG: Salida de guardar configuración: 
*Nov 20 00:48:04.766: %SYS-5-CONFIG_I: Configured from console by console
SW18#
SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1470 bytes to 1000 bytes[OK]
SW18#
SW18#
SW18#
SW18#exit





























































SW18 con0 is now available





Press RETURN to get started.




2024-11-19 20:48:12,547 INFO: VLAN 65 asignada al puerto Ethernet0/0 en switch 192.168.100.121
2024-11-19 20:50:02,116 INFO: VLAN 7 - UNE_COMUNICACIOENS agregada en switch 192.168.100.121
2024-11-20 09:46:25,946 INFO: Aplicación iniciada
2024-11-20 09:46:26,132 INFO: Aplicación iniciada
2024-11-20 09:47:10,241 INFO: VLAN 89 - cocina agregada en switch 192.168.100.121
2024-11-20 09:54:32,039 INFO: Aplicación iniciada
2024-11-20 09:55:38,737 INFO: Aplicación iniciada
2024-11-20 09:55:38,888 INFO: Aplicación iniciada
2024-11-20 10:04:13,987 INFO: Aplicación iniciada
2024-11-20 10:04:14,131 INFO: Aplicación iniciada
2024-11-20 10:10:44,860 INFO: Aplicación iniciada
2024-11-20 10:10:45,014 INFO: Aplicación iniciada
2024-11-20 10:14:07,900 INFO: Aplicación iniciada
2024-11-20 10:15:27,403 INFO: Aplicación iniciada
2024-11-20 10:24:25,026 INFO: Enviando comandos al switch 192.168.100.121: ['interface Ethernet0/3', 'switchport mode access', 'switchport access vlan 121', 'no shutdown', 'exit']
2024-11-20 10:24:25,975 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#
SW18(config)#
SW18(config)#interface Ethernet0/3
SW18(config-if)#
SW18(config-if)#switchport mode access
SW18(config-if)#
SW18(config-if)#switchport access vlan 121
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config
SW18(config)#
SW18(config)#
SW18(config)#end
SW18#
2024-11-20 10:24:25,975 INFO: Guardando configuración en switch 192.168.100.121
2024-11-20 10:24:30,480 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1499 bytes to 1015 bytes[OK]
SW18#
SW18#
*Nov 20 14:24:25.856: %SYS-5-CONFIG_I: Configured from console by console
2024-11-20 10:24:30,623 INFO: VLAN 121 asignada al puerto Ethernet0/3 en switch 192.168.100.121
2024-11-20 10:34:56,359 INFO: Aplicación iniciada
2024-11-20 10:34:56,518 INFO: Aplicación iniciada
2024-11-20 10:36:18,974 INFO: Aplicación iniciada
2024-11-20 10:49:36,290 INFO: Aplicación iniciada
2024-11-20 10:49:36,450 INFO: Aplicación iniciada
2024-11-20 10:51:52,247 ERROR: Error al agregar VLAN en 192.168.100.121: BaseConnection.__init__() got an unexpected keyword argument 'hostname'
2024-11-20 10:54:40,680 INFO: Aplicación iniciada
2024-11-20 10:55:24,020 INFO: Aplicación iniciada
2024-11-20 10:55:43,867 INFO: Aplicación iniciada
2024-11-20 10:55:52,447 INFO: Aplicación iniciada
2024-11-20 10:55:52,631 INFO: Aplicación iniciada
2024-11-20 10:56:12,932 ERROR: Error al agregar VLAN en 192.168.100.121: BaseConnection.__init__() got an unexpected keyword argument 'hostname'
2024-11-20 10:56:20,729 ERROR: Error al agregar VLAN en 192.168.100.121: BaseConnection.__init__() got an unexpected keyword argument 'hostname'
2024-11-20 10:56:33,000 ERROR: Error al agregar VLAN en 192.168.100.121: BaseConnection.__init__() got an unexpected keyword argument 'hostname'
2024-11-20 10:57:08,631 ERROR: Error al agregar VLAN en 192.168.100.121: BaseConnection.__init__() got an unexpected keyword argument 'hostname'
2024-11-20 10:57:48,646 ERROR: Error al agregar VLAN en 192.168.100.121: BaseConnection.__init__() got an unexpected keyword argument 'hostname'
2024-11-20 10:58:36,425 INFO: Aplicación iniciada
2024-11-20 10:58:36,587 INFO: Aplicación iniciada
2024-11-20 10:58:43,430 INFO: Aplicación iniciada
2024-11-20 10:58:43,618 INFO: Aplicación iniciada
2024-11-20 10:59:22,492 INFO: VLAN 2 - Casa agregada en switch 192.168.100.121
2024-11-20 10:59:43,175 INFO: Enviando comandos al switch 192.168.100.121: ['interface Ethernet0/0', 'switchport mode access', 'switchport access vlan 2', 'no shutdown', 'exit']
2024-11-20 10:59:44,625 DEBUG: Salida de comandos: 
SW18#
SW18#
SW18#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW18(config)#

SW18(config)#
SW18(config)#interface Ethernet0/0
SW18(config-if)#
SW18(config-if)#switchport mode access
SW18(config-if)#
SW18(config-if)#switchport access vlan 2
SW18(config-if)#
SW18(config-if)#no shutdown
SW18(config-if)#
SW18(config-if)#exit
SW18(config)#

SW18(config)#
SW18(config)#end
SW18#
2024-11-20 10:59:44,626 INFO: Guardando configuración en switch 192.168.100.121
2024-11-20 10:59:49,132 DEBUG: Salida de guardar configuración: 

SW18#
SW18#write memory
Building configuration...
Compressed configuration from 1498 bytes to 1013 bytes[OK]
SW18#
SW18#
*Nov 20 14:59:44.545: %SYS-5-CONFIG_I: Configured from console by console
2024-11-20 10:59:49,265 INFO: VLAN 2 asignada al puerto Ethernet0/0 en switch 192.168.100.121
2024-11-20 11:00:12,302 INFO: Aplicación iniciada
2024-11-20 11:00:12,452 INFO: Aplicación iniciada
2024-11-20 11:01:31,090 INFO: Aplicación iniciada
2024-11-20 11:01:31,233 INFO: Aplicación iniciada
2024-11-27 20:37:15,993 INFO: Aplicación iniciada
2024-11-27 20:37:17,775 INFO: Aplicación iniciada
2024-11-27 20:39:20,973 ERROR: Error al agregar VLAN en 192.168.100.121: [Errno 113] No route to host
2024-11-27 20:41:20,501 INFO: VLAN 74 - administracion agregada en switch 192.168.100.121
2024-11-27 20:45:31,441 INFO: Aplicación iniciada
2024-11-27 20:45:33,455 INFO: Aplicación iniciada
2024-11-28 19:02:18,613 INFO: Aplicación iniciada
2024-11-28 19:02:20,436 INFO: Aplicación iniciada
2024-12-02 17:18:06,528 INFO: Aplicación iniciada
2024-12-02 17:18:08,870 INFO: Aplicación iniciada
2024-12-02 17:23:25,117 INFO: VLAN 72 - Negocios agregada en switch 192.168.100.121
2024-12-02 17:32:34,925 INFO: Aplicación iniciada
2024-12-02 17:57:48,265 INFO: Aplicación iniciada
2024-12-02 17:57:50,028 INFO: Aplicación iniciada
2024-12-02 18:00:04,703 INFO: Aplicación iniciada
2024-12-02 18:00:06,562 INFO: Aplicación iniciada
2024-12-02 18:07:25,453 INFO: Aplicación iniciada
2024-12-02 18:07:28,151 INFO: Aplicación iniciada
2024-12-02 18:07:44,912 INFO: Aplicación iniciada
2024-12-02 18:09:44,634 INFO: Aplicación iniciada
2024-12-02 18:09:47,235 INFO: Aplicación iniciada
2024-12-02 18:26:51,949 INFO: Aplicación iniciada
2024-12-02 18:26:54,150 INFO: Aplicación iniciada
2024-12-02 18:27:47,617 INFO: Aplicación iniciada
2024-12-02 18:27:55,559 INFO: Aplicación iniciada
2024-12-02 18:27:57,883 INFO: Aplicación iniciada
2024-12-02 18:30:13,606 INFO: Aplicación iniciada
2024-12-02 18:30:15,586 INFO: Aplicación iniciada
2024-12-02 18:33:47,222 INFO: Aplicación iniciada
2024-12-02 18:33:49,536 INFO: Aplicación iniciada
2024-12-02 18:38:37,794 INFO: Aplicación iniciada
2024-12-02 18:38:50,114 INFO: Aplicación iniciada
2024-12-02 18:41:56,260 INFO: Aplicación iniciada
2024-12-02 18:41:58,220 INFO: Aplicación iniciada
2024-12-02 18:42:33,605 INFO: Aplicación iniciada
2024-12-02 18:42:35,717 INFO: Aplicación iniciada
2024-12-02 18:43:36,029 INFO: Aplicación iniciada
2024-12-02 18:44:04,661 INFO: Aplicación iniciada
2024-12-02 18:44:07,033 INFO: Aplicación iniciada
2024-12-02 18:45:49,020 INFO: Aplicación iniciada
2024-12-02 18:45:51,254 INFO: Aplicación iniciada
2024-12-02 19:35:15,555 INFO: Aplicación iniciada
2024-12-02 19:35:17,951 INFO: Aplicación iniciada
2024-12-02 19:57:18,805 INFO: Aplicación iniciada
2024-12-02 19:57:40,336 INFO: Aplicación iniciada
2024-12-02 19:57:42,275 INFO: Aplicación iniciada
2024-12-02 20:03:08,580 INFO: Aplicación iniciada
2024-12-02 20:03:58,632 INFO: Aplicación iniciada
2024-12-02 20:04:00,665 INFO: Aplicación iniciada
2024-12-02 20:04:34,405 INFO: Aplicación iniciada
2024-12-02 20:11:42,540 INFO: Aplicación iniciada
2024-12-02 20:14:19,960 INFO: Aplicación iniciada
2024-12-02 20:52:08,017 INFO: Aplicación iniciada
2024-12-02 20:52:10,051 INFO: Aplicación iniciada
2024-12-02 21:11:12,134 INFO: Aplicación iniciada
2024-12-02 21:11:14,637 INFO: Aplicación iniciada
2024-12-05 00:12:30,676 INFO: Aplicación iniciada
2024-12-05 00:12:33,063 INFO: Aplicación iniciada
2024-12-05 00:17:15,537 ERROR: Error al obtener VLANs de 192.168.100.121: [Errno 113] No route to host
2024-12-05 01:24:04,837 INFO: Aplicación iniciada
2024-12-05 01:24:06,920 INFO: Aplicación iniciada
2024-12-05 01:32:58,330 INFO: Aplicación iniciada
2024-12-05 01:33:00,294 INFO: Aplicación iniciada
2024-12-05 09:07:05,296 INFO: Aplicación iniciada
2024-12-05 09:07:07,274 INFO: Aplicación iniciada
2024-12-05 09:10:53,878 INFO: Aplicación iniciada
2024-12-05 09:10:55,942 INFO: Aplicación iniciada
2024-12-05 09:11:49,938 INFO: Aplicación iniciada
2024-12-05 09:11:53,984 INFO: Aplicación iniciada
2024-12-05 09:11:56,010 INFO: Aplicación iniciada
2024-12-05 09:15:03,514 INFO: Aplicación iniciada
2024-12-05 09:16:25,186 INFO: Aplicación iniciada
2024-12-05 09:36:16,909 INFO: Aplicación iniciada
2024-12-05 09:36:19,217 INFO: Aplicación iniciada
2024-12-05 09:40:08,248 INFO: Aplicación iniciada
2024-12-05 09:40:10,388 INFO: Aplicación iniciada
2024-12-05 09:51:34,903 INFO: Aplicación iniciada
2024-12-05 09:51:37,059 INFO: Aplicación iniciada
2024-12-05 09:53:15,814 INFO: Aplicación iniciada
2024-12-05 09:53:17,839 INFO: Aplicación iniciada
2024-12-05 10:03:44,806 INFO: Aplicación iniciada
2024-12-05 10:04:41,512 INFO: Aplicación iniciada
2024-12-05 10:04:57,260 INFO: Aplicación iniciada
2024-12-05 10:04:59,201 INFO: Aplicación iniciada
2024-12-05 10:06:18,144 INFO: Aplicación iniciada
2024-12-05 10:06:20,072 INFO: Aplicación iniciada
2024-12-05 10:11:22,178 INFO: Aplicación iniciada
2024-12-05 10:11:59,853 INFO: Aplicación iniciada
2024-12-05 10:12:01,833 INFO: Aplicación iniciada
2024-12-05 10:13:03,428 INFO: Aplicación iniciada
2024-12-05 10:13:05,249 INFO: Aplicación iniciada
2024-12-05 10:14:50,585 INFO: Aplicación iniciada
2024-12-05 10:16:02,113 INFO: Aplicación iniciada
2024-12-05 10:16:04,168 INFO: Aplicación iniciada
2024-12-05 10:17:23,200 INFO: Aplicación iniciada
2024-12-05 10:17:24,961 INFO: Aplicación iniciada
2024-12-05 10:18:42,139 INFO: Aplicación iniciada
2024-12-05 10:19:11,558 INFO: Aplicación iniciada
2024-12-05 10:19:14,261 INFO: Aplicación iniciada
2024-12-05 10:20:35,315 INFO: Aplicación iniciada
2024-12-05 10:20:37,273 INFO: Aplicación iniciada
2024-12-05 10:22:09,457 INFO: Aplicación iniciada
2024-12-05 10:22:11,311 INFO: Aplicación iniciada
2024-12-05 10:23:01,188 INFO: Aplicación iniciada
2024-12-05 10:23:05,799 INFO: Aplicación iniciada
2024-12-05 10:23:07,729 INFO: Aplicación iniciada
2024-12-05 10:24:10,850 INFO: Aplicación iniciada
2024-12-05 10:24:12,709 INFO: Aplicación iniciada
2024-12-05 10:26:34,706 INFO: Aplicación iniciada
2024-12-05 10:26:36,767 INFO: Aplicación iniciada
2024-12-05 10:33:09,767 INFO: Aplicación iniciada
2024-12-05 10:33:12,440 INFO: Aplicación iniciada
2024-12-05 10:34:04,378 INFO: Aplicación iniciada
2024-12-05 10:34:06,276 INFO: Aplicación iniciada
2024-12-05 10:45:34,626 INFO: Aplicación iniciada
2024-12-05 10:45:36,426 INFO: Aplicación iniciada
2024-12-05 10:47:56,122 INFO: Aplicación iniciada
2024-12-05 10:47:59,077 INFO: Aplicación iniciada
2024-12-05 10:48:01,037 INFO: Aplicación iniciada
2024-12-05 10:48:56,908 INFO: Aplicación iniciada
2024-12-05 10:48:59,233 INFO: Aplicación iniciada
2024-12-05 10:49:46,820 INFO: Aplicación iniciada
2024-12-05 10:49:53,350 INFO: Aplicación iniciada
2024-12-05 10:49:55,108 INFO: Aplicación iniciada
2024-12-05 10:58:25,963 INFO: Aplicación iniciada
2024-12-05 10:58:27,904 INFO: Aplicación iniciada
2024-12-05 10:58:54,445 INFO: Aplicación iniciada
2024-12-05 10:58:58,104 INFO: Aplicación iniciada
2024-12-05 10:58:59,945 INFO: Aplicación iniciada
2024-12-05 11:12:09,229 INFO: Aplicación iniciada
2024-12-05 11:12:11,135 INFO: Aplicación iniciada
2024-12-05 11:22:01,168 INFO: Aplicación iniciada
2024-12-05 11:22:03,115 INFO: Aplicación iniciada
2024-12-05 11:31:10,007 INFO: Aplicación iniciada
2024-12-05 11:31:11,841 INFO: Aplicación iniciada
2024-12-05 11:31:35,192 INFO: Datos recibidos: {'switch': 'R18-Nelson'}
2024-12-05 11:31:36,602 INFO: Datos recibidos: {'switch': 'R18-Nelson'}
2024-12-05 11:33:02,694 INFO: Aplicación iniciada
2024-12-05 11:33:05,870 INFO: Aplicación iniciada
2024-12-05 11:33:07,760 INFO: Aplicación iniciada
2024-12-05 11:33:23,590 INFO: Datos recibidos: {'switch': 'R18-Nelson'}
2024-12-05 11:38:43,029 INFO: Aplicación iniciada
2024-12-05 11:38:44,981 INFO: Aplicación iniciada
2024-12-05 11:39:00,935 INFO: Datos recibidos: {'switch': 'R18-Nelson'}
2024-12-05 11:39:01,948 INFO: Datos recibidos: {'switch': 'R18-Nelson'}
2024-12-05 11:40:16,497 INFO: Aplicación iniciada
2024-12-05 11:40:19,704 INFO: Aplicación iniciada
2024-12-05 11:40:21,653 INFO: Aplicación iniciada
2024-12-05 11:40:40,104 INFO: Datos recibidos: {'switch': 'R18-Nelson'}
2024-12-05 11:40:43,567 INFO: Datos recibidos: {'switch': 'R18-Nelson'}
2024-12-05 11:42:39,274 INFO: Aplicación iniciada
2024-12-05 11:42:55,404 INFO: Aplicación iniciada
2024-12-05 11:42:57,486 INFO: Aplicación iniciada
2024-12-05 11:43:24,730 INFO: Datos recibidos: {'switch': 'R18-Nelson'}
2024-12-05 11:44:46,976 INFO: Aplicación iniciada
2024-12-05 11:44:48,944 INFO: Aplicación iniciada
2024-12-05 11:45:20,721 INFO: Datos recibidos: {'switch': 'S19-Scarlett'}
2024-12-05 11:45:23,612 INFO: Datos recibidos: {'switch': 'S19-Scarlett'}
2024-12-05 11:46:10,126 INFO: Aplicación iniciada
2024-12-05 11:46:12,037 INFO: Aplicación iniciada
2024-12-05 11:48:27,574 INFO: Aplicación iniciada
2024-12-05 11:48:29,480 INFO: Aplicación iniciada
2024-12-05 11:49:05,326 ERROR: Error al obtener VLANs de R18-Nelson: 

Pattern not detected: 'show\\ vlan\\ brief' in output.

Things you might try to fix this:
1. Adjust the regex pattern to better identify the terminating string. Note, in
many situations the pattern is automatically based on the network device's prompt.
2. Increase the read_timeout to a larger value.

You can also look at the Netmiko session_log or debug log for more information.


2024-12-05 11:51:13,537 INFO: Aplicación iniciada
2024-12-05 11:51:16,802 INFO: Aplicación iniciada
2024-12-05 11:51:19,363 INFO: Aplicación iniciada
2024-12-05 11:53:21,919 INFO: Aplicación iniciada
2024-12-05 11:53:23,758 INFO: Aplicación iniciada
2024-12-05 12:00:37,237 INFO: Aplicación iniciada
2024-12-05 12:01:06,293 INFO: Aplicación iniciada
2024-12-05 12:01:08,545 INFO: Aplicación iniciada
2024-12-05 12:02:18,789 INFO: Aplicación iniciada
2024-12-05 12:02:22,589 INFO: Aplicación iniciada
2024-12-05 12:02:24,618 INFO: Aplicación iniciada
2024-12-05 12:09:45,060 INFO: Aplicación iniciada
2024-12-05 12:09:55,165 INFO: Aplicación iniciada
2024-12-05 12:12:42,084 INFO: Aplicación iniciada
2024-12-05 12:12:43,940 INFO: Aplicación iniciada
2024-12-05 12:18:27,000 INFO: Aplicación iniciada
2024-12-05 12:21:38,613 INFO: Aplicación iniciada
2024-12-05 12:21:40,383 INFO: Aplicación iniciada
2024-12-05 12:22:39,575 INFO: Aplicación iniciada
2024-12-05 12:22:41,613 INFO: Aplicación iniciada
2024-12-05 12:29:29,349 INFO: Aplicación iniciada
2024-12-05 12:29:31,322 INFO: Aplicación iniciada
2024-12-05 12:33:35,271 INFO: Aplicación iniciada
2024-12-05 12:33:38,371 INFO: Aplicación iniciada
2024-12-05 12:33:40,566 INFO: Aplicación iniciada
2024-12-05 12:35:08,197 INFO: Aplicación iniciada
2024-12-05 12:35:11,852 INFO: Aplicación iniciada
2024-12-05 12:35:14,047 INFO: Aplicación iniciada
2024-12-05 12:38:32,033 INFO: Aplicación iniciada
2024-12-05 12:38:33,883 INFO: Aplicación iniciada
2024-12-05 12:40:18,691 INFO: Aplicación iniciada
2024-12-05 12:40:21,023 INFO: Aplicación iniciada
2024-12-05 12:43:47,022 INFO: Aplicación iniciada
2024-12-05 12:43:48,696 INFO: Aplicación iniciada
2024-12-05 12:45:40,970 INFO: Aplicación iniciada
2024-12-05 12:45:43,028 INFO: Aplicación iniciada
2024-12-05 12:48:07,423 INFO: Aplicación iniciada
2024-12-05 12:48:09,368 INFO: Aplicación iniciada
2024-12-05 12:49:18,061 INFO: Aplicación iniciada
2024-12-05 12:49:20,275 INFO: Aplicación iniciada
2024-12-05 12:51:10,246 INFO: Aplicación iniciada
2024-12-05 12:51:12,875 INFO: Aplicación iniciada
2024-12-05 12:54:02,634 INFO: Aplicación iniciada
2024-12-05 12:54:04,405 INFO: Aplicación iniciada
2024-12-05 12:59:16,794 INFO: Aplicación iniciada
2024-12-05 12:59:18,888 INFO: Aplicación iniciada
2024-12-05 13:06:52,538 INFO: Aplicación iniciada
2024-12-05 13:06:54,469 INFO: Aplicación iniciada
2024-12-05 13:08:51,085 INFO: Aplicación iniciada
2024-12-05 13:08:53,034 INFO: Aplicación iniciada
2024-12-05 13:46:36,076 INFO: Aplicación iniciada
2024-12-05 13:46:37,899 INFO: Aplicación iniciada
2024-12-05 13:53:00,475 INFO: Aplicación iniciada
2024-12-05 13:53:02,228 INFO: Aplicación iniciada
2024-12-05 13:59:10,606 INFO: Aplicación iniciada
2024-12-05 13:59:13,816 INFO: Aplicación iniciada
2024-12-05 13:59:15,783 INFO: Aplicación iniciada
2024-12-05 14:04:48,828 INFO: Aplicación iniciada
2024-12-05 14:06:12,667 INFO: Aplicación iniciada
2024-12-05 14:06:51,652 INFO: Aplicación iniciada
2024-12-05 14:07:10,217 INFO: Aplicación iniciada
2024-12-05 14:08:12,015 INFO: Aplicación iniciada
2024-12-05 14:08:13,950 INFO: Aplicación iniciada
2024-12-05 14:12:36,758 INFO: Aplicación iniciada
2024-12-05 14:12:38,722 INFO: Aplicación iniciada
2024-12-05 14:17:29,923 INFO: Aplicación iniciada
2024-12-05 14:17:32,694 INFO: Aplicación iniciada
2024-12-05 14:39:15,121 INFO: Aplicación iniciada
2024-12-05 14:39:38,520 INFO: Aplicación iniciada
2024-12-05 14:39:40,783 INFO: Aplicación iniciada
2024-12-05 14:42:56,226 INFO: Aplicación iniciada
2024-12-05 14:42:58,173 INFO: Aplicación iniciada
2024-12-05 14:47:20,493 INFO: Aplicación iniciada
2024-12-05 14:47:22,414 INFO: Aplicación iniciada
2024-12-05 14:54:42,242 INFO: Aplicación iniciada
2024-12-05 14:54:44,894 INFO: Aplicación iniciada
2024-12-05 15:00:35,322 INFO: Aplicación iniciada
2024-12-05 15:00:37,136 INFO: Aplicación iniciada
2024-12-05 15:01:30,488 INFO: Aplicación iniciada
2024-12-05 15:02:00,833 INFO: Aplicación iniciada
2024-12-05 15:04:39,839 INFO: Aplicación iniciada
2024-12-05 15:17:17,554 INFO: Aplicación iniciada
2024-12-05 15:17:28,983 INFO: Aplicación iniciada
2024-12-05 15:17:31,018 INFO: Aplicación iniciada
2024-12-05 15:26:31,775 INFO: Aplicación iniciada
2024-12-05 15:28:35,112 INFO: Aplicación iniciada
2024-12-05 15:29:09,127 INFO: Aplicación iniciada
2024-12-05 15:29:10,984 INFO: Aplicación iniciada
2024-12-05 15:36:16,602 INFO: Aplicación iniciada
2024-12-05 15:36:18,777 INFO: Aplicación iniciada
2024-12-05 15:38:17,736 INFO: Aplicación iniciada
2024-12-05 15:38:40,716 INFO: Aplicación iniciada
2024-12-05 15:38:42,522 INFO: Aplicación iniciada
2024-12-05 15:45:10,372 INFO: Aplicación iniciada
2024-12-05 15:45:13,284 INFO: Aplicación iniciada
2024-12-05 15:45:15,214 INFO: Aplicación iniciada
2024-12-05 15:56:48,551 INFO: Aplicación iniciada
2024-12-05 15:56:50,626 INFO: Aplicación iniciada
2024-12-05 15:58:47,650 INFO: Aplicación iniciada
2024-12-05 15:58:49,758 INFO: Aplicación iniciada
2024-12-05 16:00:19,468 INFO: Aplicación iniciada
2024-12-05 16:00:21,270 INFO: Aplicación iniciada
2024-12-05 16:01:45,608 INFO: Aplicación iniciada
2024-12-05 16:01:47,564 INFO: Aplicación iniciada
2024-12-05 16:05:08,670 ERROR: Error al obtener VLANs de 192.168.100.121: 
Pattern not detected: '%\\ Unknown\\ command\\ or\\ computer\\ n' in output.

Things you might try to fix this:
1. Explicitly set your pattern using the expect_string argument.
2. Increase the read_timeout to a larger value.

You can also look at the Netmiko session_log or debug log for more information.


2024-12-05 16:08:41,049 INFO: Aplicación iniciada
2024-12-05 16:08:43,084 INFO: Aplicación iniciada
2024-12-05 16:12:06,812 INFO: Aplicación iniciada
2024-12-05 16:12:08,644 INFO: Aplicación iniciada
2024-12-05 16:23:25,198 INFO: Aplicación iniciada
2024-12-05 16:23:26,922 INFO: Aplicación iniciada
2024-12-05 16:25:47,220 INFO: Aplicación iniciada
2024-12-05 16:25:49,292 INFO: Aplicación iniciada
2024-12-05 16:26:26,532 INFO: Aplicación iniciada
2024-12-05 16:32:17,207 INFO: Aplicación iniciada
2024-12-05 16:32:19,077 INFO: Aplicación iniciada
2024-12-05 17:10:44,083 INFO: Aplicación iniciada
2024-12-05 17:10:46,131 INFO: Aplicación iniciada
2024-12-05 17:13:47,337 INFO: Aplicación iniciada
2024-12-05 17:13:49,296 INFO: Aplicación iniciada
2024-12-05 17:21:54,671 INFO: Aplicación iniciada
2024-12-05 17:21:57,162 INFO: Aplicación iniciada
2024-12-05 17:22:20,649 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:22:23,878 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:22:23,878 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:22:23,879 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:22:23,880 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:22:49,181 INFO: Aplicación iniciada
2024-12-05 17:22:52,192 INFO: Aplicación iniciada
2024-12-05 17:22:54,198 INFO: Aplicación iniciada
2024-12-05 17:23:10,644 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:23:13,314 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:23:13,315 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:23:13,316 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:23:13,317 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:24:22,743 INFO: Aplicación iniciada
2024-12-05 17:24:25,254 INFO: Aplicación iniciada
2024-12-05 17:29:23,133 INFO: Aplicación iniciada
2024-12-05 17:29:25,095 INFO: Aplicación iniciada
2024-12-05 17:29:41,050 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:29:43,688 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:29:43,689 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:29:43,690 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:29:43,691 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:32:01,602 INFO: Aplicación iniciada
2024-12-05 17:32:04,610 INFO: Aplicación iniciada
2024-12-05 17:32:06,578 INFO: Aplicación iniciada
2024-12-05 17:32:20,694 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:32:23,424 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:32:23,425 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:32:23,427 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:32:23,427 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:35:11,958 INFO: Aplicación iniciada
2024-12-05 17:35:13,771 INFO: Aplicación iniciada
2024-12-05 17:35:57,388 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:36:00,117 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:36:00,118 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:36:00,119 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:36:00,120 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:41:49,966 INFO: Aplicación iniciada
2024-12-05 17:41:52,480 INFO: Aplicación iniciada
2024-12-05 17:42:22,469 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:42:25,147 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:42:25,148 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:42:25,150 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:42:25,150 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:43:48,688 INFO: Aplicación iniciada
2024-12-05 17:43:51,561 INFO: Aplicación iniciada
2024-12-05 17:43:53,491 INFO: Aplicación iniciada
2024-12-05 17:44:05,911 INFO: Enviando comandos al switch S19-Scarlett: ['enable_passwordinterface Ethernet0/1', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:44:08,539 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:44:08,539 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:44:08,541 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:44:08,541 INFO: VLAN 78 asignada al puerto Ethernet0/1 en switch S19-Scarlett
2024-12-05 17:44:35,748 INFO: Aplicación iniciada
2024-12-05 17:44:40,292 INFO: Aplicación iniciada
2024-12-05 17:44:42,391 INFO: Aplicación iniciada
2024-12-05 17:44:57,615 INFO: Enviando comandos al switch S19-Scarlett: ['pucmminterface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:45:00,319 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:45:00,320 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:45:00,322 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:45:00,322 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:45:40,714 INFO: Aplicación iniciada
2024-12-05 17:45:42,655 INFO: Aplicación iniciada
2024-12-05 17:45:55,223 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:45:57,891 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:45:57,892 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:45:57,894 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:45:57,894 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:46:23,121 INFO: Aplicación iniciada
2024-12-05 17:46:25,245 INFO: Aplicación iniciada
2024-12-05 17:46:38,452 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:46:42,629 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:46:42,630 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:46:42,631 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:46:42,632 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:47:39,635 INFO: Aplicación iniciada
2024-12-05 17:47:42,119 INFO: Aplicación iniciada
2024-12-05 17:47:54,207 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:47:56,901 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:47:56,902 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:47:56,903 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:47:56,904 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:48:20,333 INFO: Aplicación iniciada
2024-12-05 17:48:23,412 INFO: Aplicación iniciada
2024-12-05 17:48:25,327 INFO: Aplicación iniciada
2024-12-05 17:48:45,281 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:48:47,903 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:48:47,904 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:48:47,905 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:48:47,906 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:51:05,457 INFO: Aplicación iniciada
2024-12-05 17:51:07,541 INFO: Aplicación iniciada
2024-12-05 17:51:21,146 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:51:24,408 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:51:24,409 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:51:24,410 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:51:24,411 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:52:19,940 INFO: Aplicación iniciada
2024-12-05 17:52:22,153 INFO: Aplicación iniciada
2024-12-05 17:53:33,161 INFO: Aplicación iniciada
2024-12-05 17:53:35,074 INFO: Aplicación iniciada
2024-12-05 17:53:55,607 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 17:53:58,361 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 17:53:58,361 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 17:53:58,362 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 17:53:58,363 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 17:56:54,027 INFO: Aplicación iniciada
2024-12-05 17:57:09,876 INFO: Aplicación iniciada
2024-12-05 18:00:04,141 INFO: Enviando comandos al switch R18-Nelson: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 72', 'no shutdown']
2024-12-05 18:00:07,553 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'R18-Nelson': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 18:00:07,554 INFO: Guardando configuración en switch R18-Nelson
2024-12-05 18:00:07,958 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {'R18-Nelson': MultiResult: [Result: "netmiko_send_command"]}
2024-12-05 18:00:07,959 INFO: VLAN 72 asignada al puerto Ethernet0/2 en switch R18-Nelson
2024-12-05 18:05:11,357 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/2', 'switchport mode access', 'switchport access vlan 78', 'no shutdown']
2024-12-05 18:05:14,933 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 18:05:14,933 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 18:05:15,309 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {'S19-Scarlett': MultiResult: [Result: "netmiko_send_command"]}
2024-12-05 18:05:15,310 INFO: VLAN 78 asignada al puerto Ethernet0/2 en switch S19-Scarlett
2024-12-05 18:47:00,086 INFO: Aplicación iniciada
2024-12-05 18:47:02,288 INFO: Aplicación iniciada
2024-12-05 18:51:27,622 INFO: Aplicación iniciada
2024-12-05 18:51:29,928 INFO: Aplicación iniciada
2024-12-05 18:54:40,236 INFO: Enviando comandos al switch S19-Scarlett: ['interface Ethernet0/1', 'switchport mode access', 'switchport access vlan 87', 'no shutdown']
2024-12-05 18:54:40,240 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {}
2024-12-05 18:54:40,242 INFO: Guardando configuración en switch S19-Scarlett
2024-12-05 18:54:40,245 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 18:54:40,247 INFO: VLAN 87 asignada al puerto Ethernet0/1 en switch S19-Scarlett
2024-12-05 18:58:10,752 INFO: Enviando comandos al switch R18-Nelson: ['interface Ethernet0/3', 'switchport mode access', 'switchport access vlan 87', 'no shutdown']
2024-12-05 18:58:11,022 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'R18-Nelson': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 18:58:11,022 INFO: Guardando configuración en switch R18-Nelson
2024-12-05 18:58:11,202 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {'R18-Nelson': MultiResult: [Result: "netmiko_send_command"]}
2024-12-05 18:58:11,203 INFO: VLAN 87 asignada al puerto Ethernet0/3 en switch R18-Nelson
2024-12-05 19:00:19,635 INFO: Aplicación iniciada
2024-12-05 19:00:21,380 INFO: Aplicación iniciada
2024-12-05 19:07:22,335 INFO: Aplicación iniciada
2024-12-05 19:07:25,030 INFO: Aplicación iniciada
2024-12-05 19:08:38,885 INFO: Enviando comandos al switch R18-Nelson: ['interface Ethernet0/1', 'switchport mode access', 'switchport access vlan 89', 'no shutdown']
2024-12-05 19:08:40,874 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'R18-Nelson': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 19:08:40,875 INFO: Guardando configuración en switch R18-Nelson
2024-12-05 19:08:41,004 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {'R18-Nelson': MultiResult: [Result: "netmiko_send_command"]}
2024-12-05 19:08:41,005 INFO: VLAN 89 asignada al puerto Ethernet0/1 en switch R18-Nelson
2024-12-05 19:09:55,910 INFO: Enviando comandos al switch R18-Nelson: ['interface Ethernet0/1', 'switchport mode access', 'switchport access vlan 87', 'no shutdown']
2024-12-05 19:10:05,935 DEBUG: Salida de comandos: AggregatedResult (netmiko_send_config): {'R18-Nelson': MultiResult: [Result: "netmiko_send_config"]}
2024-12-05 19:10:05,936 INFO: Guardando configuración en switch R18-Nelson
2024-12-05 19:10:05,938 DEBUG: Salida de guardar configuración: AggregatedResult (netmiko_send_command): {}
2024-12-05 19:10:05,938 INFO: VLAN 87 asignada al puerto Ethernet0/1 en switch R18-Nelson
2024-12-05 19:15:18,110 ERROR: Error al obtener VLANs de 192.168.100.121: timed out
